Clean_368_01/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime      	0;

stopAt          endTime;

endTime         100;

deltaT          0.01;

writeControl    timeStep;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           1;
maxAlphaCo      1;

maxDeltaT       1;

functions
{
    velocityProbes
    {
        type            probes;
        functionObjectLibs ("libsampling.so");
        enabled         true;
        outputControl   timeStep;
        outputInterval  100;

        fields
        (
            U
        );

        probeLocations
        (
            ( 15.31 -0.61 0 )
            ( 15.31 -0.60 0 )
            ( 15.31 -0.59 0 )
            ( 15.31 -0.58 0 )
            ( 15.31 -0.57 0 )
            ( 15.31 -0.56 0 )
            ( 15.31 -0.55 0 )
            ( 15.31 -0.54 0 )
            ( 15.31 -0.53 0 )
            ( 15.31 -0.52 0 )
            ( 15.31 -0.51 0 )
            ( 15.31 -0.50 0 )
            ( 15.31 -0.49 0 )
            ( 15.31 -0.48 0 )
            ( 15.31 -0.47 0 )
            ( 15.31 -0.46 0 )
            ( 15.31 -0.45 0 )
            ( 15.31 -0.44 0 )
            ( 15.31 -0.43 0 )
            ( 15.31 -0.42 0 )
            ( 15.31 -0.41 0 )
            ( 15.31 -0.40 0 )
            ( 15.31 -0.39 0 )
            ( 15.31 -0.38 0 )
            ( 15.31 -0.37 0 )
            ( 15.31 -0.36 0 )
            ( 15.31 -0.35 0 )
            ( 15.31 -0.34 0 )
            ( 15.31 -0.33 0 )
            ( 15.31 -0.32 0 )
            ( 15.31 -0.31 0 )
            ( 15.31 -0.30 0 )
            ( 15.31 -0.29 0 )
            ( 15.31 -0.28 0 )
            ( 15.31 -0.27 0 )
            ( 15.31 -0.26 0 )
            ( 15.31 -0.25 0 )
            ( 15.31 -0.24 0 )
            ( 15.31 -0.23 0 )
            ( 15.31 -0.22 0 )
            ( 15.31 -0.21 0 )
            ( 15.31 -0.20 0 )
            ( 15.31 -0.19 0 )
            ( 15.31 -0.18 0 )
            ( 15.31 -0.17 0 )
            ( 15.31 -0.16 0 )
            ( 15.31 -0.15 0 )
            ( 15.31 -0.14 0 )
            ( 15.31 -0.13 0 )
            ( 15.31 -0.12 0 )
            ( 15.31 -0.11 0 )
            ( 15.31 -0.10 0 )
            ( 15.31 -0.09 0 )
            ( 15.31 -0.08 0 )
            ( 15.31 -0.07 0 )
            ( 15.31 -0.06 0 )
            ( 15.31 -0.05 0 )
            ( 15.31 -0.04 0 )
            ( 15.31 -0.03 0 )
            ( 15.31 -0.02 0 )
            ( 15.31 -0.01 0 )
            ( 15.31 0 0 )
            ( 15.31 0.01 0 )
            ( 15.31 0.02 0 )
            ( 15.31 0.03 0 )
            ( 15.31 0.04 0 )
            ( 15.31 0.05 0 )
            ( 15.31 0.06 0 )
            ( 15.31 0.07 0 )
            ( 15.31 0.08 0 )
            ( 15.31 0.09 0 )
            ( 15.31 0.10 0 )
            ( 15.31 0.11 0 )
            ( 15.31 0.12 0 )
            ( 15.31 0.13 0 )
            ( 15.31 0.14 0 )
        );

    }
}
// ************************************************************************* //
